let task;

// //   РОБОТА В АУДИТОРІЇ
// // ______________________________________________________________________________________________________________________________________________________
// //
// // - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// // - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// // - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// // - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// // - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
//
//
// // - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// task = 1;
// console.log('----' + task + '----');
// let arr1 = ['a', 'b', 'c'];
// for (let i = 1; i <= 3; i++) {
//     arr1.push(i);
// }
// console.log(arr1);
//
// // - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// task = 2;
// console.log('----' + task + '----');
// let arr2_1 = [1, 2, 3];
// let arr2_2 = [];
// for (let i = 0; i < arr2_1.length; i++) {
//     // arr2_2.push(arr2_1[arr2_1.length - 1 - i]);
//     //або так:
//     arr2_2[i] = arr2_1[arr2_1.length - 1 - i];
// }
// console.log(arr2_1);
// console.log(arr2_2);
//
// // - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// task = 3;
// console.log('----' + task + '----');
// let arr3 = [1, 2, 3];
// console.log(arr3);
// // arr3.push(4, 5, 6);
// //або так:
// // for (let i = 1; i <= 3; i++) {
// //     arr3.push(arr3.length + 1);
// // }
// //або так:
// let l = arr3.length;
// for (let i = l; i < l + 3; i++) {
//     arr3[i] = i + 1;
// }
//
// console.log(arr3);
//
// // - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// task = 4;
// console.log('----' + task + '----');
// let arr4 = [1, 2, 3];
// console.log(arr4);
// // arr4.unshift(4, 5, 6);
// //або так:
// let m = arr4.length;
// for (let i = m + 3; i > m; i--) {
//     arr4.unshift(i);
// }
// console.log(arr4);
//
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// task = 5;
// console.log('----' + task + '----');
// let arr5 = ['js', 'css', 'jq'];
// // console.log(arr5);
// console.log(arr5.shift());
// // console.log(arr5);
//
// // - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// task = 6;
// console.log('----' + task + '----');
// let arr6 = ['js', 'css', 'jq'];
// // console.log(arr6);
// console.log(arr6.pop());
// // console.log(arr6);
//
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// task = 7;
// console.log('----' + task + '----');
// let arr7 = [1, 2, 3, 4, 5];
// console.log(arr7);
// arr7 = arr7.slice(3);
// console.log(arr7);
//
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// task = 8;
// console.log('----' + task + '----');
// let arr8 = [1, 2, 3, 4, 5];
// console.log(arr8);
// arr8 = arr8.slice(0, 2);
// console.log(arr8);
//
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// task = 9;
// console.log('----' + task + '----');
// let arr9 = [1, 2, 3, 4, 5];
// console.log(arr9);
// arr9.splice(1, 2);
// console.log(arr9);
//
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// task = 10;
// console.log('----' + task + '----');
// let arr10 = [1, 2, 3, 4, 5];
// console.log(arr10);
// arr10.splice(3, 0, 'a', 'b', 'c');
// console.log(arr10);
//
// // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// task = 11;
// console.log('----' + task + '----');
// let arr11 = [1, 2, 3, 4, 5];
// console.log(arr11);
// arr11.splice(5, 0, 'e');
// arr11.splice(4, 0, 'c');
// arr11.splice(1, 0, 'a', 'b');
// console.log(arr11);
//
// // - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// task = 12;
// console.log('----' + task + '----');
// let arr12 = [14, 15, 18, 27, 44, 1, 2, 3, 4, 5];
// console.log(arr12);
// for (let number of arr12) {
//     if (number % 2 === 0) {
//         console.log(number);
//     }
// }
//
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// task = 13;
// console.log('----' + task + '----');
// let arr13_1 = [14, 15, 18, 27, 44, 1, 2, 3, 4, 5];
// let arr13_2 = [];
// console.log(arr13_1);
// for (let number of arr13_1) {
//     arr13_2.push(number);
// }
// console.log(arr13_2);
//
// // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// task = 14;
// console.log('----' + task + '----');
// let arr14_1 = [14, 15, 18, 27, 44, 1, 2, 3, 4, 5];
// let arr14_2 = [];
// console.log(arr14_1);
// for (let i = 0; i < arr14_1.length; i++) {
//     arr14_2[i] = arr14_1[i];
// }
// console.log(arr14_2);


//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
task = 15;
console.log('----' + task + '----');
let arr15 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
console.log(arr15);
// 1. перебрати його циклом while
task = '15_1';
console.log('----' + task + '----');
{
    let i = 0;
    while (i < arr15.length) {
        console.log(arr15[i]);
        i++;
    }
}

// 2. перебрати його циклом for
task = '15_2';
console.log('----' + task + '----');
for (let i = 0; i < arr15.length; i++) {
    console.log(arr15[i]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
task = '15_3';
console.log('----' + task + '----');
{
    let i = 0;
    while (i < arr15.length) {
        (i % 2) && console.log(arr15[i]);
        i++;
    }
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
task = '15_4';
console.log('----' + task + '----');
for (let i = 0; i < arr15.length; i++) {
    (i % 2) && console.log(arr15[i]);
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
task = '15_5';
console.log('----' + task + '----');
{
    let i = 0;
    while (i < arr15.length) {
        !(arr15[i] % 2) && console.log(arr15[i]);
        i++;
    }
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
task = '15_6';
console.log('----' + task + '----');
for (let i = 0; i < arr15.length; i++) {
    !(arr15[i] % 2) && console.log(arr15[i]);
}

// 7. замінити кожне число кратне 3 на слово "okten"
task = '15_7';
console.log('----' + task + '----');
console.log(arr15);
for (let i = 0; i < arr15.length; i++) {
    !(arr15[i] % 3) && (arr15[i] = 'okten');
}
console.log(arr15);

// 8. вивести масив в зворотньому порядку.
task = '15_8';
console.log('----' + task + '----');
console.log(arr15);
for (let i = arr15.length - 1; i >= 0; i--) {
    console.log(arr15[i]);
}

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 1. перебрати його циклом while
task = '15_9_1';
console.log('----' + task + '----');
arr15 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
console.log(arr15);
{
    let i = arr15.length - 1;
    while (i >= 0) {
        console.log(arr15[i]);
        i--;
    }
}

// 2. перебрати його циклом for
task = '15_9_2';
console.log('----' + task + '----');
for (let i = arr15.length - 1; !(i < 0); i--) {
    console.log(arr15[i]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
task = '15_9_3';
console.log('----' + task + '----');
{
    console.log(arr15);
    let i = arr15.length - 1;
    while (!(i < 0)) {
        (i % 2) && console.log(arr15[i]);
        i--;
    }
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
task = '15_9_4';
console.log('----' + task + '----');
for (let i = arr15.length - 1; i >= 0; i--) {
    (i % 2) && console.log(arr15[i]);
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
task = '15_9_5';
console.log('----' + task + '----');
{
    let i = arr15.length - 1;
    while (i >= 0) {
        !(arr15[i] % 2) && console.log(arr15[i]);
        i--;
    }
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
task = '15_9_6';
console.log('----' + task + '----');
for (let i = arr15.length - 1; i >= 0; i--) {
    !(arr15[i] % 2) && console.log(arr15[i]);
}

// 7. замінити кожне число кратне 3 на слово "okten"
task = '15_9_7';
console.log('----' + task + '----');
console.log(arr15);
for (let i = arr15.length - 1; i >= 0; i--) {
    !(arr15[i] % 3) && (arr15[i] = 'okten');
}
console.log(arr15);

// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.

// - заповнити його 50 парними числами за допомоги циклу.
task = '15_10_1';
console.log('----' + task + '----');
let arr15_10_1 = [];
{
    let i = 1;
    while (arr15_10_1.length < 50) {
        !(i % 2) && arr15_10_1.push(i);
        i++;
    }
}
console.log(arr15_10_1);

// - заповнити його 50 непарними числами за допомоги циклу.
task = '15_10_2';
console.log('----' + task + '----');
let arr15_10_2 = [];
{
    let i = 1;
    while (arr15_10_2.length < 50) {
        (i % 2) && arr15_10_2.push(i);
        i++;
    }
}
console.log(arr15_10_2);


//1. Створити пустий масив та :
//        a. заповнити його 50 парними числами за допомоги циклу.
//        b. заповнити його 50 непарними числами за допомоги циклу.
//        c. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//  2. Вивести за допомогою console.log кожен третій елемен
//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//  5. Вивести кожен елемент масиву, сусід зпарва якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
task = 16;
console.log('----' + task + '----');

//1. Створити пустий масив та :

//        a. заповнити його 50 парними числами за допомоги циклу.
task = '16_1_a';
console.log('----' + task + '----');
let arr16_1_a = [];
for (let i = 1; arr16_1_a.length < 50; i++) {
    !(i % 2) && arr16_1_a.push(i);
}
console.log(arr16_1_a);

//        b. заповнити його 50 непарними числами за допомоги циклу.
task = '16_1_b';
console.log('----' + task + '----');
let arr16_1_b = [];
for (let i = 1; arr16_1_b.length < 50; i++) {
    (i % 2) && arr16_1_b.push(i);
}
console.log(arr16_1_b);

//        c. используя Math.random заполнить массив из ???(сколько хотите) элементов.
//  диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
task = '16_1_c';
console.log('----' + task + '----');
let arr16_1_c = [];
{
    let min = 8;
    let max = 732;
    for (let i = 1; arr16_1_c.length < 21; i++) {
        arr16_1_c.push(Math.floor(Math.random() * (max - min + 1) + min));
    }
}
console.log(arr16_1_c);

//  2. Вивести за допомогою console.log кожен третій елемен
task = '16_2';
console.log('----' + task + '----');
for (let i = 0; i < arr16_1_c.length + 1; i += 3) {
    (i > 0) && console.log(arr16_1_c[i - 1]);
}

//  3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
task = '16_3';
console.log('----' + task + '----');
for (let i = 0; i < arr16_1_c.length + 1; i += 3) {
    (i > 0) && !(arr16_1_c[i - 1] % 2) && console.log(arr16_1_c[i - 1]);
}
//  4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
task = '16_4';
console.log('----' + task + '----');
let arr16_4 = [];
for (let i = 0; i < arr16_1_c.length + 1; i += 3) {
    (i > 0) && !(arr16_1_c[i - 1] % 2) && console.log(arr16_1_c[i - 1]);
    (i > 0) && !(arr16_1_c[i - 1] % 2) && arr16_4.push(arr16_1_c[i - 1]);
}
console.log(arr16_4);

//  5. Вивести кожен елемент масиву, сусід зпарва якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
task = '16_5';
console.log('----' + task + '----');
console.log(arr16_1_c);
for (let i = 0; i < arr16_1_c.length; i++) {
    (i > 0) && (i < arr16_1_c.length + 1) && !(arr16_1_c[i] % 2) && console.log(arr16_1_c[i - 1]);
}

//  6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
task = '16_6';
console.log('----' + task + '----');
let arr16_6 = [100, 250, 50, 168, 120, 345, 188];
let sum = 0;
for (let elemArr16_6 of arr16_6) {
    sum += elemArr16_6;
}
console.log(arr16_6);
console.log(sum);
console.log(sum / arr16_6.length);

//  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
task = '16_7';
console.log('----' + task + '----');
let arr16_7_1 = [];
let arr16_7_2 = [];
{
    let min = 1;
    let max = 10;
    for (let i = 0; i < 15; i++) {
        arr16_7_1[i] = (Math.floor(Math.random() * (max - min + 1) + min));
    }
}
console.log(arr16_7_1);
let arrLenght = arr16_7_1.length;
for (let i = 0; i < arrLenght; i++) {
    arr16_7_2[i] = (arr16_7_1.shift() * 5);
}
console.log(arr16_7_1);
console.log(arr16_7_2);

//  8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
task = '16_8';
console.log('----' + task + '----');
let arr16_8_1 = [15, -7, true, 'hello', 's', '23', false];
let arr16_8_2 = [];
for (let i = 0; i < arr16_8_1.length; i++) {
    ((typeof arr16_8_1[i]) == 'number') && arr16_8_2.push(arr16_8_1[i]);
}
console.log(arr16_8_1);
console.log(arr16_8_2);


// Додатково
// ______________________________________________________________________________________________________________________________________________________
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
task = 'Додатково';
console.log('----' + task + '----');
let arr = ['a', 'b', 'c'];
console.log(arr);
{
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
    let word = '';
    for (let i = 0; i < arr.length; i++) {
        word += arr[i];
    }
    console.log(word);
}
{
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
    let word = '';
    let i = 0;
    while (i < arr.length) {
        word += arr[i];
        i++;
    }
    console.log(word);
}
{
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
    let word = '';
    for (let elem of arr) {
        word += elem;
    }
    console.log(word);
}
